vgromov/esfwxe/cpp/drivers/stm32mx/EseUsbCdc.cpp
#include <esfwxe/target.h>
#include <esfwxe/type.h>
#include <esfwxe/trace.h>
#include <esfwxe/utils.h>

// FreeRTOS
#include <FreeRTOS.h>
#include <queue.h>
#include <semphr.h>
#include <task.h>
#include <timers.h>

#include <esfwxe/cpp/os/EseOsDefs.h>
#include <esfwxe/cpp/concept/EseChannelIntf.h>
#include <esfwxe/cpp/concept/EseChannel.h>
#include <esfwxe/cpp/EseException.h>
#include <esfwxe/cpp/os/EseMutex.h>
#include <esfwxe/cpp/os/EseSemaphore.h>
#include <esfwxe/cpp/os/EseQueue.h>
#include <esfwxe/cpp/os/EseTask.h>
#include <esfwxe/cpp/os/EseKernel.h>

//----------------------------------------------------------------------
// TODO: conditionally include proper DEFS and HAL for other MCUs
#include <stm32f1xx.h>
#include <stm32f1xx_hal.h>

//----------------------------------------------------------------------
#include <esfwxe/cpp/drivers/stm32mx/EseUsbCdc.h>

#ifndef ESE_USB_ISR_TRACE_CFG
# define ESE_USB_ISR_TRACE_CFG()      ((void)0)
#endif
#ifndef ESE_USB_ISR_TRACE_ON
# define ESE_USB_ISR_TRACE_ON()       ((void)0)
#endif
#ifndef ESE_USB_ISR_TRACE_OFF
# define ESE_USB_ISR_TRACE_OFF()      ((void)0)
#endif
#ifndef ESE_USBCDCRX_TRACE_CFG
# define ESE_USBCDCRX_TRACE_CFG()     ((void)0)
#endif
#ifndef ESE_USBCDCRX_TRACE_ON
# define ESE_USBCDCRX_TRACE_ON()      ((void)0)
#endif
#ifndef ESE_USBCDCRX_TRACE_OFF
# define ESE_USBCDCRX_TRACE_OFF()     ((void)0)
#endif
#ifndef ESE_USBCDCTX_TRACE_CFG
# define ESE_USBCDCTX_TRACE_CFG()     ((void)0)
#endif
#ifndef ESE_USBCDCTX_TRACE_ON
# define ESE_USBCDCTX_TRACE_ON()      ((void)0)
#endif
#ifndef ESE_USBCDCTX_TRACE_OFF
# define ESE_USBCDCTX_TRACE_OFF()     ((void)0)
#endif

#if defined(USE_USBCDC_TRACE)
# define ESE_USBCDC_TRACE             ES_DEBUG_TRACE
#else
# define ESE_USBCDC_TRACE(...)        ((void)0)
#endif

extern "C" 
{

static int8_t CDC_Init_FS(void);
static int8_t CDC_DeInit_FS(void);
static int8_t CDC_Control_FS(uint8_t cmd, uint8_t* pbuf, uint16_t length);
static int8_t CDC_Receive_FS(uint8_t* pbuf, uint32_t *Len);

USBD_CDC_ItfTypeDef USBD_Interface_fops_FS = 
{
  CDC_Init_FS,
  CDC_DeInit_FS,
  CDC_Control_FS,  
  CDC_Receive_FS
};

/// Return default USB_CNTR mask configuration
uint32_t USB_CNTR_MaskGet(void)
{
  return 
    USB_CNTR_CTRM  | 
    USB_CNTR_WKUPM | 
    USB_CNTR_SUSPM | 
//  ERR and ESOF bits never handled at driver callback anyway, so mask them out of ISR handling,
//  to avoid constant flow of these condition on unconnected bus to consume all CPU time on
//  some HW units
//
#ifdef USB_HANDLE_EXTRA_ERRORS
    USB_CNTR_ERRM  | 
    USB_CNTR_ESOFM | 
#endif
    USB_CNTR_RESETM;
}

} // extern "C"

// Check for CDC CubeMX bugs
#if CDC_DATA_HS_MAX_PACKET_SIZE > 256
# error "CDC_DATA_HS_MAX_PACKET_SIZE must not be greater than 256!"
#endif  

//---------------------------------------------------------------------------------
EseUsbCdc EseUsbCdc::_1(USB_CDC_RX_BUFFLEN, USB_CDC_TX_BUFFLEN);

EseUsbCdc::EseUsbCdc(size_t rxLen, size_t txLen) ESE_NOTHROW :
ChannelT(
  rxLen < staticIoBlockLen ? 
    staticIoBlockLen : 
    rxLen, 
  txLen < staticIoBlockLen ? 
    staticIoBlockLen : 
    txLen
),
m_txIdle(1, 1),
m_onConnected(NULL),
m_prevBlockLen(0),
m_txActive(false),
m_shouldYield(false)
{
  // set-up default line config
  m_lineCfg.bitrate = 9600; /* baud rate*/
  m_lineCfg.format = 0x00;   /* stop bits-1*/
  m_lineCfg.paritytype = 0x00;   /* parity - none*/
  m_lineCfg.datatype = 0x08;    /* nb. of bits 8*/

  /* Init USB_IP */
  /* Link The driver to the stack */
  m_h.pData = &m_devh;
  m_devh.pData = &m_h;

  m_h.Instance = USB;
  m_h.Init.dev_endpoints = 3;
  m_h.Init.speed = PCD_SPEED_FULL;
  m_h.Init.ep0_mps = DEP0CTL_MPS_64;
  m_h.Init.phy_itface = PCD_PHY_EMBEDDED;
  m_h.Init.Sof_enable = DISABLE;
  m_h.Init.low_power_enable = DISABLE;
  m_h.Init.battery_charging_enable = DISABLE;
}
//-----------------------------------------------------------------------------------

EseUsbCdc::~EseUsbCdc() ESE_NOTHROW
{
  uninit();
}
//-----------------------------------------------------------------------------------

bool EseUsbCdc::isOk() const ESE_NOTHROW
{
  return m_mx.isOk();
}
//-----------------------------------------------------------------------------------

rtosStatus EseUsbCdc::lock(esU32 tmo) ESE_NOTHROW
{
  return m_mx.lock(tmo);
}
//-----------------------------------------------------------------------------------

rtosStatus EseUsbCdc::unlock() ESE_NOTHROW
{
  return m_mx.unlock();
}
//-----------------------------------------------------------------------------------

bool EseUsbCdc::isConnected() const ESE_NOTHROW 
{ 
  return ES_BIT_IS_SET(m_flags, flagConnected); 
}
//-----------------------------------------------------------------------------------

const PCD_InitTypeDef& EseUsbCdc::dcbGet() const ESE_NOTHROW 
{ 
  return m_h.Init; 
}
//-----------------------------------------------------------------------------------

USBD_HandleTypeDef& EseUsbCdc::devHandleGet() ESE_NOTHROW 
{ 
  return m_devh; 
}
//-----------------------------------------------------------------------------------
  
bool EseUsbCdc::shouldYield() const ESE_NOTHROW 
{ 
  return m_shouldYield; 
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::resetYieldFlag() ESE_NOTHROW 
{ 
  m_shouldYield = false; 
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::dcbSet(const PCD_InitTypeDef& dcb) ESE_NOTHROW
{
  m_h.Init = dcb;
  if( m_h.Init.speed != PCD_SPEED_FULL )
    m_h.Init.speed = PCD_SPEED_FULL;
  ES_BIT_CLR(m_flags, flagConfigured);
}
//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------
// Channel implementation
//
const EseUsbCdc::ChannelT::HandleT& EseUsbCdc::doHandleGet() const ESE_NOTHROW 
{ 
  return m_h; 
}
//-----------------------------------------------------------------------------------

EseUsbCdc::ChannelT::HandleT& EseUsbCdc::doHandleGet() ESE_NOTHROW 
{ 
  return m_h; 
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::txIdleSet() ESE_NOTHROW
{
  m_txActive = false;
  m_txIdle.unlock(); // Give idle state
}
//-----------------------------------------------------------------------------------

bool EseUsbCdc::doInit() ESE_NOTHROW
{
  m_mx.init();
  m_txIdle.init();
  m_rx.init(m_rxLen);
  m_tx.init(m_txLen);
  
  txIdleSet();
  
  ESE_USB_ISR_TRACE_CFG();
  ESE_USBCDCTX_TRACE_CFG();
  ESE_USBCDCRX_TRACE_CFG();
  
