vgromov/esfwxe/cpp/drivers/stm32mx/EseUsbCdc.cpp
  return true;
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::doUninit() ESE_NOTHROW
{
  m_rx.uninit();
  m_txIdle.uninit();
  m_tx.uninit();
  m_mx.uninit();
  
  ESE_USB_ISR_TRACE_OFF();
  ESE_USBCDCTX_TRACE_OFF();
  ESE_USBCDCRX_TRACE_OFF();
}
//-----------------------------------------------------------------------------------

bool EseUsbCdc::doCheckConfigured() ESE_NOTHROW
{
  EseIsrCriticalSection cs;
  return HAL_OK == HAL_PCD_Init(&m_h);
}
//-----------------------------------------------------------------------------------

esU32 EseUsbCdc::dataXferTimeoutEstimateGet(size_t len) const ESE_NOTHROW
{
  // estimate xfer rate over full speed USB bus, using lowest speed (0,5 MBPS) estimate 
  return 1 + ((len / 500) << 2);
}
//-----------------------------------------------------------------------------------

bool EseUsbCdc::doActivate() ESE_NOTHROW
{
  m_rx.reset();
  m_tx.reset();
  
  txIdleSet();

  USBD_Init(&m_devh, &FS_Desc, DEVICE_FS);
  HAL_PCD_DevDisconnect(&m_h);
  HAL_PCD_Init(&m_h);

  // Offet from the beginning of PM memory, to actual packet buffers
  // The math is as follows: num of endpoints used * 2 (reserved for in and out pipes) * 2 (2 descriptors per pipe) * 2 (2 byte per descriptor)
  size_t pmaOffs = m_h.Init.dev_endpoints * 8;

  HAL_PCDEx_PMAConfig(&m_h, 0x00,       PCD_SNG_BUF, pmaOffs );     // EP0 (control in) - always must be there, for USB to function properly
  pmaOffs += USB_FS_MAX_PACKET_SIZE;
  HAL_PCDEx_PMAConfig(&m_h, 0x80,       PCD_SNG_BUF, pmaOffs );     // EP0 (control out) - always must be there, for USB to function properly
  pmaOffs += USB_FS_MAX_PACKET_SIZE;

  HAL_PCDEx_PMAConfig(&m_h, CDC_IN_EP,  PCD_SNG_BUF, pmaOffs );     // CDC commuinication IN
  pmaOffs += CDC_DATA_FS_MAX_PACKET_SIZE;
  HAL_PCDEx_PMAConfig(&m_h, CDC_OUT_EP, PCD_SNG_BUF, pmaOffs );     // CDC commuinication OUT
  pmaOffs += CDC_DATA_FS_MAX_PACKET_SIZE;
  HAL_PCDEx_PMAConfig(&m_h, CDC_CMD_EP, PCD_SNG_BUF, pmaOffs );     // CDC command EP

  USBD_CDC.DataIn = &onTxComplete; ///< Set up our own DataIn handler
  
  USBD_RegisterClass(&m_devh, &USBD_CDC);
  USBD_CDC_RegisterInterface(&m_devh, &USBD_Interface_fops_FS);

  // Configure and enable USB IRQs
  HAL_NVIC_SetPriority(USB_HP_IRQn, USB_HP_IRQ_PRIORITY, 0); 
  HAL_NVIC_SetPriority(USB_LP_IRQn, USB_LP_IRQ_PRIORITY, 0); 
  
  // Cleanup some interrupt flags beforhand, if set
  if( __HAL_PCD_GET_FLAG(&m_h, USB_ISTR_ERR) )
  {
    __HAL_PCD_CLEAR_FLAG(&m_h, USB_ISTR_ERR); 
  }
  
  if( __HAL_PCD_GET_FLAG(&m_h, USB_ISTR_ESOF) )
  {
    __HAL_PCD_CLEAR_FLAG(&m_h, USB_ISTR_ESOF); 
  }
  
  // Cleanup potentially pending interrupt
  HAL_NVIC_ClearPendingIRQ(USB_HP_IRQn);
  HAL_NVIC_ClearPendingIRQ(USB_LP_IRQn);

  // Enable interrupt handling
  HAL_NVIC_EnableIRQ(USB_HP_IRQn);
  HAL_NVIC_EnableIRQ(USB_LP_IRQn);
  
  // Switch USB connection pin on
  m_error = USBD_Start(&m_devh);
  
  return 0 == m_error;
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::doDeactivate() ESE_NOTHROW
{
  HAL_PCD_DevDisconnect(&m_h);
  USBD_Stop(&m_devh);

  {
    EseIsrCriticalSection cs;
    USBD_DeInit(&m_devh);
  }

  HAL_NVIC_DisableIRQ(USB_HP_IRQn);
  HAL_NVIC_DisableIRQ(USB_LP_IRQn);
  m_rx.reset();
  m_tx.reset();
  
  txIdleSet();
}
//-----------------------------------------------------------------------------------
// Internal ISR helpers
//-----------------------------------------------------------------------------------

void EseUsbCdc::usbBuffersSetup() ESE_NOTHROW
{
  USBD_CDC_SetTxBuffer(&m_devh, m_tmpTx, 0);
  USBD_CDC_SetRxBuffer(&m_devh, m_tmpRx);
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::onRxFromIsr(uint8_t* data, uint32_t* len) ESE_NOTHROW
{
  uint8_t* end = data + (*len);
  while( data < end )
  {
    esU8 item = *data++;
    if( rtosErrorQueueFull == m_rx.pushBackFromISR(item, m_shouldYield) )
    {
      esU8 tmp;
      m_rx.popFrontFromISR(tmp, m_shouldYield);
      m_rx.pushBackFromISR(item, m_shouldYield);
      m_error = rtosErrorRxOverrun;
    }
  }

  // Always continue data listening
  USBD_CDC_ReceivePacket(&m_devh);
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::onSetLineCodingFromIsr(const uint8_t* pbuf) ESE_NOTHROW
{
  m_lineCfg.bitrate    = (uint32_t)(pbuf[0] | (pbuf[1] << 8) |
                         (pbuf[2] << 16) | (pbuf[3] << 24));
  m_lineCfg.format     = pbuf[4];
  m_lineCfg.paritytype = pbuf[5];
  m_lineCfg.datatype   = pbuf[6];    
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::onGetLineCodingFromIsr(uint8_t* pbuf) ESE_NOTHROW
{
  pbuf[0] = (uint8_t)(m_lineCfg.bitrate);
  pbuf[1] = (uint8_t)(m_lineCfg.bitrate >> 8);
  pbuf[2] = (uint8_t)(m_lineCfg.bitrate >> 16);
  pbuf[3] = (uint8_t)(m_lineCfg.bitrate >> 24);
  pbuf[4] = m_lineCfg.format;
  pbuf[5] = m_lineCfg.paritytype;
  pbuf[6] = m_lineCfg.datatype; 
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::onConnectedSet(OnConnectedT proc) ESE_NOTHROW
{
  __disable_irq();
  m_onConnected = proc;
  __enable_irq();
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::onConnect(bool connected) ESE_NOTHROW
{
  if( connected )
    ES_BIT_SET(m_flags, flagConnected);
  else
    ES_BIT_CLR(m_flags, flagConnected);
    
  if( m_onConnected )
  {
    bool shouldYield = false;

    m_onConnected( 
      connected, 
      shouldYield
    );
    
    m_shouldYield |= shouldYield;
  }
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::txIdleSetFromISR() ESE_NOTHROW
{
  m_txActive = false;
  m_txIdle.unlockFromISR(
    m_shouldYield
  );
}
//-----------------------------------------------------------------------------------

uint8_t EseUsbCdc::continueTxFromIsr() ESE_NOTHROW
{
  // fill as much data from tx as we can fill in m_tmpTx
  esU8 item;
  esU8* pos = m_tmpTx;
  esU8* end = pos + staticIoBlockLen;
  while( 
    pos < end && 
    rtosOK == m_tx.popFrontFromISR(
      item, 
      m_shouldYield
    ) 
  )
    *pos++ = item;
  
  if( m_tmpTx != pos )
  {
    m_prevBlockLen = pos-m_tmpTx;
    
    USBD_CDC_SetTxBuffer(
      &m_devh, 
      m_tmpTx, 
      m_prevBlockLen
    );
 
