vgromov/esfwxe/cpp/drivers/stm32mx/EseUsbCdc.cpp
    ESE_USBCDC_TRACE("  sending %d\n", m_prevBlockLen);

    m_error = USBD_CDC_TransmitPacket(&m_devh);

    if( USBD_OK != m_error )
      txIdleSetFromISR();
    
    return static_cast<uint8_t>(m_error);
  }
  else
  {
    ESE_USBCDC_TRACE("  prev is %d\n", m_prevBlockLen);

    // Send ZLP if we ended up previous block transfer on % staticIoBlockLen boundary
    if( 
      m_prevBlockLen && 
      0 == (m_prevBlockLen % staticIoBlockLen) 
    )
    {
      m_prevBlockLen = 0;
      USBD_CDC_SetTxBuffer(
        &m_devh, 
        m_tmpTx, 
        0
      );

      ESE_USBCDC_TRACE("  sending ZLP\n");

      m_error = USBD_CDC_TransmitPacket(&m_devh);

      if( USBD_OK != m_error )
        txIdleSetFromISR();
      
      return static_cast<uint8_t>(m_error);
    }
    else
    {
      ESE_USBCDC_TRACE("  completing TX\n");
      
      // set signal TX is idle then
      txIdleSetFromISR();
    }
  }

  return USBD_OK;
}
//-----------------------------------------------------------------------------------

uint8_t EseUsbCdc::onTxComplete(USBD_HandleTypeDef *pdev, uint8_t epnum) ESE_NOTHROW
{
  USBD_CDC_HandleTypeDef* hcdc = reinterpret_cast<USBD_CDC_HandleTypeDef*>(pdev->pClassData);
  
  if(pdev->pClassData != NULL)
  {
    hcdc->TxState = 0;
    return EseUsbCdc::_1.continueTxFromIsr();
  }

  return USBD_FAIL;
}
//-----------------------------------------------------------------------------------

size_t EseUsbCdc::doReceive(esU8* data, size_t toRead, esU32 tmo) ESE_NOTHROW
{
#ifdef USE_USBCDC_TRACE
  size_t expected = toRead;
#endif

  esU32 tmoTicks = (tmo == rtosMaxDelay) ? 
    portMAX_DELAY :
    pdMS_TO_TICKS(tmo);

  ESE_USBCDCRX_TRACE_ON();

  esU32 prevTs = EseTask::tickCountGet();
  esU32 ts = prevTs;
  esU32 ticksPerByte = tmoTicks/toRead;
  if( !ticksPerByte )
    ticksPerByte = 1;
  
  esU8* pos = data;

  while( toRead )
  {
    rtosStatus stat = m_rx.popFront(
      *pos, 
      ticksPerByte, 
      true
    );
    
    if( rtosOK == stat )
    {
      ESE_USBCDCRX_TRACE_OFF();
      
      --toRead;
      ++pos;
      
      ESE_USBCDCRX_TRACE_ON();
    }
    
    if( tmoTicks != portMAX_DELAY )
    {
      ts = EseTask::tickCountGet();
      esU32 delta = (ts < prevTs) ? prevTs-ts : ts-prevTs;
      
      if( tmoTicks > delta )
        tmoTicks -= delta;
      else
        break;

      prevTs = ts;
    }
  }
 
  ESE_USBCDCRX_TRACE_OFF();
  
  ESE_USBCDC_TRACE("  got %d of %d, in tmo=%d\n", pos-data, expected, tmo);
  
  return pos-data;
}
//-----------------------------------------------------------------------------------

rtosStatus EseUsbCdc::txIdleCheck() ESE_NOTHROW
{
  if( m_txActive )
  {
    rtosStatus stat = m_txIdle.lock(1);
    if( rtosOK == stat )
      m_txIdle.unlock(); //< Give semaphore
      
    return stat;
  }
  
  return rtosOK;
}
//-----------------------------------------------------------------------------------

void EseUsbCdc::txActiveSet() ESE_NOTHROW
{
  m_txActive = true;
  m_txIdle.lock(0);
}
//-----------------------------------------------------------------------------------

size_t EseUsbCdc::doSend(const esU8* data, size_t toWrite, esU32 tmo) ESE_NOTHROW
{
  const esU8* pos = data;

  // 1) If there is no ongoing TX operation, we may stuff data from tx queue directly into static buffer
  // with zero waiting time as well
  //
  
  rtosStatus stat = txIdleCheck();
  
  ESE_USBCDCTX_TRACE_ON();
  
  if( rtosOK == stat )
  {
    esU8* sPos = m_tmpTx;
    esU8* sEnd = m_tmpTx+staticIoBlockLen;
    while( sPos < sEnd && toWrite )
    {
      ESE_USBCDCTX_TRACE_OFF();
      
      *sPos++ = *pos++;
      --toWrite;
      
      ESE_USBCDCTX_TRACE_ON();
    }
      
    // if we still have data to write - append these data to the end of tx queue,
    // we should have free space there now
    while( toWrite )
    {
      ESE_USBCDCTX_TRACE_OFF();
    
      stat = m_tx.pushBack(
        *pos, 
        0
      );
      
      ESE_USBCDCTX_TRACE_ON();

      if( rtosOK != stat )
        break;
    
      --toWrite;
      ++pos;
    }
    
    // Initiate transmission explicitly
    // Wrap in critical section, to prevent messing with IO irq routines
    // which may gain access to m_devh at this time
    {
      EseIsrCriticalSection cs;

      m_prevBlockLen = sPos-m_tmpTx;
      USBD_CDC_SetTxBuffer(&m_devh, m_tmpTx, m_prevBlockLen);
      
      ESE_USBCDC_TRACE("  sending %d\n", m_prevBlockLen);
      
      m_error = USBD_CDC_TransmitPacket(&m_devh);
      
      if( USBD_OK != m_error )
      {
        txIdleSet();
        
        ESE_USBCDCTX_TRACE_OFF();
    
        return 0;
      }
      else
        txActiveSet();
    }
  }
  
  if( toWrite )
  {
    // 3) Push the rest of data (if any) in tx queue with specified timeout;
    // transmission IRQ routine will drain tx in background, in (at most) staticIoBlockLen chunks
    esU32 tmoTicks = (tmo == rtosMaxDelay) ? 
      portMAX_DELAY :
      pdMS_TO_TICKS(tmo);

    // Always give us at least 1 OS tick to write
    if( 0 == tmoTicks )
      tmoTicks = 1;

    esU32 prevTs = EseTask::tickCountGet();
    esU32 ts = prevTs;

    while( toWrite )
    {
      ESE_USBCDCTX_TRACE_OFF();
      
      stat = m_tx.pushBack(
        *pos, 
        tmoTicks, 
        true
      );

      ESE_USBCDCTX_TRACE_ON();
      
      if( rtosOK != stat )
        break;
    
      if( tmoTicks != portMAX_DELAY )
      {
        ts = EseTask::tickCountGet();
        esU32 delta = (ts < prevTs) ? prevTs-ts : ts-prevTs;
        
        if( tmoTicks > delta )
          tmoTicks -= delta;
        else
          tmoTicks = 1;

        prevTs = ts;
      }

      --toWrite;
      ++pos;
    }
  }
  
  ESE_USBCDCTX_TRACE_OFF();
 
  return pos-data;
}
//-----------------------------------------------------------------------------------

int EseUsbCdc::ioCtlSet(esU32 ctl, void* data) ESE_NOTHROW
{
  switch(ctl)
  {
  case ctlDcb:
    if( isActive() )
      return rtosErrorParameterNotSupported;
    else
      dcbSet(*reinterpret_cast<const PCD_InitTypeDef*>(data));
    break;
  case ctlRate:
    // For USB CDC channel, we are free to set any line rate without de-activating the channel,
    // nothing is wrong with that.
    m_lineCfg.bitrate = reinterpret_cast<esU32>(data);
    break;
  case ctlRxReset:
    m_rx.reset();
    break;
  case ctlTxReset:
    m_tx.reset();
    break;
  case ctlReset:
    m_tx.reset();
    m_rx.reset();
    break;
  case ctlHwConnect:
    if( reinterpret_cast<int>(data) )
      HAL_PCD_DevConnect(&m_h);
    else
      HAL_PCD_DevDisconnect(&m_h);
    break;
  default:
    return ChannelT::ioCtlSet(ctl, data);
  }

  return rtosOK;
}
//-----------------------------------------------------------------------------------

int EseUsbCdc::ioCtlGet(esU32 ctl, void* data) const ESE_NOTHROW
{
  switch(ctl)
  {
  case ctlDcb:
    *reinterpret_cast<PCD_InitTypeDef*>(data) = m_h.Init;
    break;
  case ctlRate:
    *reinterpret_cast<esU32*>(data) = m_lineCfg.bitrate;
    break;
  case ctlIsValidRate:
    if( reinterpret_cast<esU32>(data) > 921600 )
      return rtosErrorParameterValueInvalid;
    break;
  case ctlRxPendingGet:
    *reinterpret_cast<size_t*>(data) = m_rx.countGet();
     break;
  case ctlTxPendingGet:
    *reinterpret_cast<size_t*>(data) = m_tx.countGet();
    break;
  case ctlHwConnect:
    return rtosErrorParameterNotSupported;
  default:
    return ChannelT::ioCtlGet(ctl, data);
  }

  return rtosOK;
}
//------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

extern "C" 
{
// Empty USB Device Low Level initialization, which should replace one, generated by CubeMX - usbd_conf.c file
//-----------------------------------------------------------------------------------

USBD_StatusTypeDef USBD_LL_Init(USBD_HandleTypeDef* ESE_UNUSED(pdev))
{ 
  return USBD_OK;
}
//-----------------------------------------------------------------------------------
// USB CDC IRQ handlers
//
//-----------------------------------------------------------------------------------

void USB_HP_IRQHandler(void) ESE_NOTHROW
{
  EseUsbCdc::_1.resetYieldFlag();
  HAL_NVIC_ClearPendingIRQ(USB_HP_IRQn);

  ESE_USB_ISR_TRACE_ON();

  HAL_PCD_IRQHandler(&EseUsbCdc::_1.handleGet());

