vgromov/esfwxe/cpp/drivers/stm32mx/EseUsbCdc.cpp
  ESE_USB_ISR_TRACE_OFF();

  portEND_SWITCHING_ISR(
    EseUsbCdc::_1.shouldYield() ? 
      pdTRUE : 
      pdFALSE
  );
}
//-----------------------------------------------------------------------------------

void USB_LP_IRQHandler(void) ESE_NOTHROW
{
  EseUsbCdc::_1.resetYieldFlag();
  HAL_NVIC_ClearPendingIRQ(USB_LP_IRQn);

  ESE_USB_ISR_TRACE_ON();
  
  HAL_PCD_IRQHandler(&EseUsbCdc::_1.handleGet());

  ESE_USB_ISR_TRACE_OFF();

  portEND_SWITCHING_ISR(
    EseUsbCdc::_1.shouldYield() ? 
      pdTRUE : 
      pdFALSE
  );
}
//------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------
// CDC interface

/* Private functions ---------------------------------------------------------*/
/**
  * @brief  CDC_Init_FS
  *         Initializes the CDC media low layer over the FS USB IP
  * @param  None
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */
//-----------------------------------------------------------------------------------

static int8_t CDC_Init_FS(void)
{
  /* Set Application Buffers */
  EseUsbCdc::_1.usbBuffersSetup();
  EseUsbCdc::_1.onConnect(true);
  
  return (USBD_OK);
}
//-----------------------------------------------------------------------------------

/**
  * @brief  CDC_DeInit_FS
  *         DeInitializes the CDC media low layer
  * @param  None
  * @retval Result of the opeartion: USBD_OK if all operations are OK else USBD_FAIL
  */
//-----------------------------------------------------------------------------------

static int8_t CDC_DeInit_FS(void)
{
  /* USER CODE BEGIN 5 */ 
  EseUsbCdc::_1.onConnect(false);
  return (USBD_OK);
  /* USER CODE END 5 */ 
}
//-----------------------------------------------------------------------------------

/**
  * @brief  CDC_Control_FS
  *         Manage the CDC class requests
  * @param  Cmd: Command code            
  * @param  Buf: Buffer containing command data (request parameters)
  * @param  Len: Number of data to be sent (in bytes)
  * @retval Result of the opeartion: USBD_OK if all operations are OK else USBD_FAIL
  */
//-----------------------------------------------------------------------------------
static int8_t CDC_Control_FS(uint8_t cmd, uint8_t* pbuf, uint16_t length)
{ 
  /* USER CODE BEGIN 6 */
  switch (cmd)
  {
  case CDC_SEND_ENCAPSULATED_COMMAND:
 
    break;

  case CDC_GET_ENCAPSULATED_RESPONSE:
 
    break;

  case CDC_SET_COMM_FEATURE:
 
    break;

  case CDC_GET_COMM_FEATURE:

    break;

  case CDC_CLEAR_COMM_FEATURE:

    break;

  case CDC_SET_LINE_CODING:   
    EseUsbCdc::_1.onSetLineCodingFromIsr(pbuf);
    break;

  case CDC_GET_LINE_CODING:     
    EseUsbCdc::_1.onGetLineCodingFromIsr(pbuf);
    break;

  case CDC_SET_CONTROL_LINE_STATE:

    break;

  case CDC_SEND_BREAK:
 
    break;    
    
  default:
    break;
  }

  return (USBD_OK);
  /* USER CODE END 6 */
}
//-----------------------------------------------------------------------------------

/**
  * @brief  CDC_Receive_FS
  *         Data received over USB OUT endpoint are sent over CDC interface 
  *         through this function.
  *           
  *         @note
  *         This function will block any OUT packet reception on USB endpoint 
  *         untill exiting this function. If you exit this function before transfer
  *         is complete on CDC interface (ie. using DMA controller) it will result 
  *         in receiving more data while previous ones are still not sent.
  *                 
  * @param  Buf: Buffer of data to be received
  * @param  Len: Number of data received (in bytes)
  * @retval Result of the opeartion: USBD_OK if all operations are OK else USBD_FAIL
  */
//-----------------------------------------------------------------------------------
static int8_t CDC_Receive_FS(uint8_t* Buf, uint32_t *Len)
{
  EseUsbCdc::_1.onRxFromIsr(Buf, Len);

  return (USBD_OK);
}
//-----------------------------------------------------------------------------------

} // extern "C"
